   - [#   1] AOR isTriangle: 
--------------------------------------------------------------------------------
  31:         if b == c:
  32:             trian += 3
  33:         
  34:         if trian == 0:
- 35:             if (Decimal(a) + Decimal(b) <= Decimal(c) or Decimal(a) + Decimal(c) <= Decimal(b) or Decimal(b) + Decimal(c) <= Decimal(a)):
+ 35:             if (Decimal(a) - Decimal(b) <= Decimal(c) or Decimal(a) + Decimal(c) <= Decimal(b) or Decimal(b) + Decimal(c) <= Decimal(a)):
  36:                 return Triangle.Type.INVALID
  37:             else:
  38:                 return Triangle.Type.SCALENE
  39:         
--------------------------------------------------------------------------------
[0.00000 s] killed by test_killMutant1_2_3_15_16_36_38_40 (test_mutationAdequate.MutantAdequateTest)

   - [#   2] AOR isTriangle: 
--------------------------------------------------------------------------------
  31:         if b == c:
  32:             trian += 3
  33:         
  34:         if trian == 0:
- 35:             if (Decimal(a) + Decimal(b) <= Decimal(c) or Decimal(a) + Decimal(c) <= Decimal(b) or Decimal(b) + Decimal(c) <= Decimal(a)):
+ 35:             if (Decimal(a) + Decimal(b) <= Decimal(c) or Decimal(a) - Decimal(c) <= Decimal(b) or Decimal(b) + Decimal(c) <= Decimal(a)):
  36:                 return Triangle.Type.INVALID
  37:             else:
  38:                 return Triangle.Type.SCALENE
  39:         
--------------------------------------------------------------------------------
[0.00000 s] killed by test_killMutant1_2_3_15_16_36_38_40 (test_mutationAdequate.MutantAdequateTest)

   - [#   3] AOR isTriangle: 
--------------------------------------------------------------------------------
  31:         if b == c:
  32:             trian += 3
  33:         
  34:         if trian == 0:
- 35:             if (Decimal(a) + Decimal(b) <= Decimal(c) or Decimal(a) + Decimal(c) <= Decimal(b) or Decimal(b) + Decimal(c) <= Decimal(a)):
+ 35:             if (Decimal(a) + Decimal(b) <= Decimal(c) or Decimal(a) + Decimal(c) <= Decimal(b) or Decimal(b) - Decimal(c) <= Decimal(a)):
  36:                 return Triangle.Type.INVALID
  37:             else:
  38:                 return Triangle.Type.SCALENE
  39:         
--------------------------------------------------------------------------------
[0.00000 s] killed by test_killMutant1_2_3_15_16_36_38_40 (test_mutationAdequate.MutantAdequateTest)

   - [#   4] AOR isTriangle: 
--------------------------------------------------------------------------------
  39:         
  40:         if trian > 3:
  41:             return Triangle.Type.EQUILATERAL
  42:         
- 43:         if (trian == 1 and Decimal(a) + Decimal(b) > Decimal(c)):
+ 43:         if (trian == 1 and Decimal(a) - Decimal(b) > Decimal(c)):
  44:             return Triangle.Type.ISOSCELES
  45:         elif (trian == 2 and Decimal(a) + Decimal(c) > Decimal(b)):
  46:             return Triangle.Type.ISOSCELES
  47:         elif (trian == 3 and Decimal(b) + Decimal(c) > Decimal(a)):
--------------------------------------------------------------------------------
[0.00000 s] killed by test_killMutant4_7_11_17_32_44_45 (test_mutationAdequate.MutantAdequateTest)

   - [#   5] AOR isTriangle: 
--------------------------------------------------------------------------------
  41:             return Triangle.Type.EQUILATERAL
  42:         
  43:         if (trian == 1 and Decimal(a) + Decimal(b) > Decimal(c)):
  44:             return Triangle.Type.ISOSCELES
- 45:         elif (trian == 2 and Decimal(a) + Decimal(c) > Decimal(b)):
+ 45:         elif (trian == 2 and Decimal(a) - Decimal(c) > Decimal(b)):
  46:             return Triangle.Type.ISOSCELES
  47:         elif (trian == 3 and Decimal(b) + Decimal(c) > Decimal(a)):
  48:             return Triangle.Type.ISOSCELES
  49:         
--------------------------------------------------------------------------------
[0.00000 s] killed by test_killMutant5_12_18_33_47_48 (test_mutationAdequate.MutantAdequateTest)

   - [#   6] AOR isTriangle: 
--------------------------------------------------------------------------------
  43:         if (trian == 1 and Decimal(a) + Decimal(b) > Decimal(c)):
  44:             return Triangle.Type.ISOSCELES
  45:         elif (trian == 2 and Decimal(a) + Decimal(c) > Decimal(b)):
  46:             return Triangle.Type.ISOSCELES
- 47:         elif (trian == 3 and Decimal(b) + Decimal(c) > Decimal(a)):
+ 47:         elif (trian == 3 and Decimal(b) - Decimal(c) > Decimal(a)):
  48:             return Triangle.Type.ISOSCELES
  49:         
  50:         return Triangle.Type.INVALID
--------------------------------------------------------------------------------
[0.00000 s] killed by test_killMutant6_19_43_50_51 (test_mutationAdequate.MutantAdequateTest)

   - [#  15] COI isTriangle: 
--------------------------------------------------------------------------------
  31:         if b == c:
  32:             trian += 3
  33:         
  34:         if trian == 0:
- 35:             if (Decimal(a) + Decimal(b) <= Decimal(c) or Decimal(a) + Decimal(c) <= Decimal(b) or Decimal(b) + Decimal(c) <= Decimal(a)):
+ 35:             if not ((Decimal(a) + Decimal(b) <= Decimal(c) or Decimal(a) + Decimal(c) <= Decimal(b) or Decimal(b) + Decimal(c) <= Decimal(a))):
  36:                 return Triangle.Type.INVALID
  37:             else:
  38:                 return Triangle.Type.SCALENE
  39:         
--------------------------------------------------------------------------------
[0.00000 s] killed by test_killMutant1_2_3_15_16_36_38_40 (test_mutationAdequate.MutantAdequateTest)

   - [#  17] COI isTriangle: 
--------------------------------------------------------------------------------
  39:         
  40:         if trian > 3:
  41:             return Triangle.Type.EQUILATERAL
  42:         
- 43:         if (trian == 1 and Decimal(a) + Decimal(b) > Decimal(c)):
+ 43:         if not ((trian == 1 and Decimal(a) + Decimal(b) > Decimal(c))):
  44:             return Triangle.Type.ISOSCELES
  45:         elif (trian == 2 and Decimal(a) + Decimal(c) > Decimal(b)):
  46:             return Triangle.Type.ISOSCELES
  47:         elif (trian == 3 and Decimal(b) + Decimal(c) > Decimal(a)):
--------------------------------------------------------------------------------
[0.00000 s] killed by test_killMutant23_24_25_46 (test_mutationAdequate.MutantAdequateTest)

   - [#  18] COI isTriangle: 
--------------------------------------------------------------------------------
  41:             return Triangle.Type.EQUILATERAL
  42:         
  43:         if (trian == 1 and Decimal(a) + Decimal(b) > Decimal(c)):
  44:             return Triangle.Type.ISOSCELES
- 45:         elif (trian == 2 and Decimal(a) + Decimal(c) > Decimal(b)):
+ 45:         elif not ((trian == 2 and Decimal(a) + Decimal(c) > Decimal(b))):
  46:             return Triangle.Type.ISOSCELES
  47:         elif (trian == 3 and Decimal(b) + Decimal(c) > Decimal(a)):
  48:             return Triangle.Type.ISOSCELES
  49:         
--------------------------------------------------------------------------------
[0.00000 s] killed by test_killMutant23_24_25_46 (test_mutationAdequate.MutantAdequateTest)

   - [#  19] COI isTriangle: 
--------------------------------------------------------------------------------
  43:         if (trian == 1 and Decimal(a) + Decimal(b) > Decimal(c)):
  44:             return Triangle.Type.ISOSCELES
  45:         elif (trian == 2 and Decimal(a) + Decimal(c) > Decimal(b)):
  46:             return Triangle.Type.ISOSCELES
- 47:         elif (trian == 3 and Decimal(b) + Decimal(c) > Decimal(a)):
+ 47:         elif not ((trian == 3 and Decimal(b) + Decimal(c) > Decimal(a))):
  48:             return Triangle.Type.ISOSCELES
  49:         
  50:         return Triangle.Type.INVALID
--------------------------------------------------------------------------------
[0.00000 s] killed by test_killMutant23_24_25_46 (test_mutationAdequate.MutantAdequateTest)

   - [#  22] LCR isTriangle: 
--------------------------------------------------------------------------------
  31:         if b == c:
  32:             trian += 3
  33:         
  34:         if trian == 0:
- 35:             if (Decimal(a) + Decimal(b) <= Decimal(c) or Decimal(a) + Decimal(c) <= Decimal(b) or Decimal(b) + Decimal(c) <= Decimal(a)):
+ 35:             if (Decimal(a) + Decimal(b) <= Decimal(c) and Decimal(a) + Decimal(c) <= Decimal(b) and Decimal(b) + Decimal(c) <= Decimal(a)):
  36:                 return Triangle.Type.INVALID
  37:             else:
  38:                 return Triangle.Type.SCALENE
  39:         
--------------------------------------------------------------------------------
[0.00000 s] killed by test_killMutant22_41 (test_mutationAdequate.MutantAdequateTest)

   - [#  23] LCR isTriangle: 
--------------------------------------------------------------------------------
  39:         
  40:         if trian > 3:
  41:             return Triangle.Type.EQUILATERAL
  42:         
- 43:         if (trian == 1 and Decimal(a) + Decimal(b) > Decimal(c)):
+ 43:         if (trian == 1 or Decimal(a) + Decimal(b) > Decimal(c)):
  44:             return Triangle.Type.ISOSCELES
  45:         elif (trian == 2 and Decimal(a) + Decimal(c) > Decimal(b)):
  46:             return Triangle.Type.ISOSCELES
  47:         elif (trian == 3 and Decimal(b) + Decimal(c) > Decimal(a)):
--------------------------------------------------------------------------------
[0.01562 s] killed by test_killMutant23_24_25_46 (test_mutationAdequate.MutantAdequateTest)

   - [#  24] LCR isTriangle: 
--------------------------------------------------------------------------------
  41:             return Triangle.Type.EQUILATERAL
  42:         
  43:         if (trian == 1 and Decimal(a) + Decimal(b) > Decimal(c)):
  44:             return Triangle.Type.ISOSCELES
- 45:         elif (trian == 2 and Decimal(a) + Decimal(c) > Decimal(b)):
+ 45:         elif (trian == 2 or Decimal(a) + Decimal(c) > Decimal(b)):
  46:             return Triangle.Type.ISOSCELES
  47:         elif (trian == 3 and Decimal(b) + Decimal(c) > Decimal(a)):
  48:             return Triangle.Type.ISOSCELES
  49:         
--------------------------------------------------------------------------------
[0.01559 s] killed by test_killMutant23_24_25_46 (test_mutationAdequate.MutantAdequateTest)

   - [#  25] LCR isTriangle: 
--------------------------------------------------------------------------------
  43:         if (trian == 1 and Decimal(a) + Decimal(b) > Decimal(c)):
  44:             return Triangle.Type.ISOSCELES
  45:         elif (trian == 2 and Decimal(a) + Decimal(c) > Decimal(b)):
  46:             return Triangle.Type.ISOSCELES
- 47:         elif (trian == 3 and Decimal(b) + Decimal(c) > Decimal(a)):
+ 47:         elif (trian == 3 or Decimal(b) + Decimal(c) > Decimal(a)):
  48:             return Triangle.Type.ISOSCELES
  49:         
  50:         return Triangle.Type.INVALID
--------------------------------------------------------------------------------
[0.00000 s] killed by test_killMutant23_24_25_46 (test_mutationAdequate.MutantAdequateTest)

   - [#  36] ROR isTriangle: 
--------------------------------------------------------------------------------
  31:         if b == c:
  32:             trian += 3
  33:         
  34:         if trian == 0:
- 35:             if (Decimal(a) + Decimal(b) <= Decimal(c) or Decimal(a) + Decimal(c) <= Decimal(b) or Decimal(b) + Decimal(c) <= Decimal(a)):
+ 35:             if (Decimal(a) + Decimal(b) >= Decimal(c) or Decimal(a) + Decimal(c) <= Decimal(b) or Decimal(b) + Decimal(c) <= Decimal(a)):
  36:                 return Triangle.Type.INVALID
  37:             else:
  38:                 return Triangle.Type.SCALENE
  39:         
--------------------------------------------------------------------------------
[0.00000 s] killed by test_killMutant1_2_3_15_16_36_38_40 (test_mutationAdequate.MutantAdequateTest)

   - [#  37] ROR isTriangle: 
--------------------------------------------------------------------------------
  31:         if b == c:
  32:             trian += 3
  33:         
  34:         if trian == 0:
- 35:             if (Decimal(a) + Decimal(b) <= Decimal(c) or Decimal(a) + Decimal(c) <= Decimal(b) or Decimal(b) + Decimal(c) <= Decimal(a)):
+ 35:             if (Decimal(a) + Decimal(b) < Decimal(c) or Decimal(a) + Decimal(c) <= Decimal(b) or Decimal(b) + Decimal(c) <= Decimal(a)):
  36:                 return Triangle.Type.INVALID
  37:             else:
  38:                 return Triangle.Type.SCALENE
  39:         
--------------------------------------------------------------------------------
[0.00000 s] killed by test_killMutant37 (test_mutationAdequate.MutantAdequateTest)

   - [#  38] ROR isTriangle: 
--------------------------------------------------------------------------------
  31:         if b == c:
  32:             trian += 3
  33:         
  34:         if trian == 0:
- 35:             if (Decimal(a) + Decimal(b) <= Decimal(c) or Decimal(a) + Decimal(c) <= Decimal(b) or Decimal(b) + Decimal(c) <= Decimal(a)):
+ 35:             if (Decimal(a) + Decimal(b) <= Decimal(c) or Decimal(a) + Decimal(c) >= Decimal(b) or Decimal(b) + Decimal(c) <= Decimal(a)):
  36:                 return Triangle.Type.INVALID
  37:             else:
  38:                 return Triangle.Type.SCALENE
  39:         
--------------------------------------------------------------------------------
[0.00000 s] killed by test_killMutant1_2_3_15_16_36_38_40 (test_mutationAdequate.MutantAdequateTest)

   - [#  39] ROR isTriangle: 
--------------------------------------------------------------------------------
  31:         if b == c:
  32:             trian += 3
  33:         
  34:         if trian == 0:
- 35:             if (Decimal(a) + Decimal(b) <= Decimal(c) or Decimal(a) + Decimal(c) <= Decimal(b) or Decimal(b) + Decimal(c) <= Decimal(a)):
+ 35:             if (Decimal(a) + Decimal(b) <= Decimal(c) or Decimal(a) + Decimal(c) < Decimal(b) or Decimal(b) + Decimal(c) <= Decimal(a)):
  36:                 return Triangle.Type.INVALID
  37:             else:
  38:                 return Triangle.Type.SCALENE
  39:         
--------------------------------------------------------------------------------
[0.00000 s] killed by test_killMutant39 (test_mutationAdequate.MutantAdequateTest)

   - [#  40] ROR isTriangle: 
--------------------------------------------------------------------------------
  31:         if b == c:
  32:             trian += 3
  33:         
  34:         if trian == 0:
- 35:             if (Decimal(a) + Decimal(b) <= Decimal(c) or Decimal(a) + Decimal(c) <= Decimal(b) or Decimal(b) + Decimal(c) <= Decimal(a)):
+ 35:             if (Decimal(a) + Decimal(b) <= Decimal(c) or Decimal(a) + Decimal(c) <= Decimal(b) or Decimal(b) + Decimal(c) >= Decimal(a)):
  36:                 return Triangle.Type.INVALID
  37:             else:
  38:                 return Triangle.Type.SCALENE
  39:         
--------------------------------------------------------------------------------
[0.00000 s] killed by test_killMutant1_2_3_15_16_36_38_40 (test_mutationAdequate.MutantAdequateTest)

   - [#  41] ROR isTriangle: 
--------------------------------------------------------------------------------
  31:         if b == c:
  32:             trian += 3
  33:         
  34:         if trian == 0:
- 35:             if (Decimal(a) + Decimal(b) <= Decimal(c) or Decimal(a) + Decimal(c) <= Decimal(b) or Decimal(b) + Decimal(c) <= Decimal(a)):
+ 35:             if (Decimal(a) + Decimal(b) <= Decimal(c) or Decimal(a) + Decimal(c) <= Decimal(b) or Decimal(b) + Decimal(c) < Decimal(a)):
  36:                 return Triangle.Type.INVALID
  37:             else:
  38:                 return Triangle.Type.SCALENE
  39:         
--------------------------------------------------------------------------------
[0.00000 s] killed by test_killMutant22_41 (test_mutationAdequate.MutantAdequateTest)

   - [#  44] ROR isTriangle: 
--------------------------------------------------------------------------------
  39:         
  40:         if trian > 3:
  41:             return Triangle.Type.EQUILATERAL
  42:         
- 43:         if (trian == 1 and Decimal(a) + Decimal(b) > Decimal(c)):
+ 43:         if (trian != 1 and Decimal(a) + Decimal(b) > Decimal(c)):
  44:             return Triangle.Type.ISOSCELES
  45:         elif (trian == 2 and Decimal(a) + Decimal(c) > Decimal(b)):
  46:             return Triangle.Type.ISOSCELES
  47:         elif (trian == 3 and Decimal(b) + Decimal(c) > Decimal(a)):
--------------------------------------------------------------------------------
[0.00000 s] killed by test_killMutant49 (test_mutationAdequate.MutantAdequateTest)

   - [#  45] ROR isTriangle: 
--------------------------------------------------------------------------------
  39:         
  40:         if trian > 3:
  41:             return Triangle.Type.EQUILATERAL
  42:         
- 43:         if (trian == 1 and Decimal(a) + Decimal(b) > Decimal(c)):
+ 43:         if (trian == 1 and Decimal(a) + Decimal(b) < Decimal(c)):
  44:             return Triangle.Type.ISOSCELES
  45:         elif (trian == 2 and Decimal(a) + Decimal(c) > Decimal(b)):
  46:             return Triangle.Type.ISOSCELES
  47:         elif (trian == 3 and Decimal(b) + Decimal(c) > Decimal(a)):
--------------------------------------------------------------------------------
[0.00000 s] killed by test_killMutant4_7_11_17_32_44_45 (test_mutationAdequate.MutantAdequateTest)

   - [#  46] ROR isTriangle: 
--------------------------------------------------------------------------------
  39:         
  40:         if trian > 3:
  41:             return Triangle.Type.EQUILATERAL
  42:         
- 43:         if (trian == 1 and Decimal(a) + Decimal(b) > Decimal(c)):
+ 43:         if (trian == 1 and Decimal(a) + Decimal(b) >= Decimal(c)):
  44:             return Triangle.Type.ISOSCELES
  45:         elif (trian == 2 and Decimal(a) + Decimal(c) > Decimal(b)):
  46:             return Triangle.Type.ISOSCELES
  47:         elif (trian == 3 and Decimal(b) + Decimal(c) > Decimal(a)):
--------------------------------------------------------------------------------
[0.00000 s] killed by test_killMutant23_24_25_46 (test_mutationAdequate.MutantAdequateTest)

   - [#  47] ROR isTriangle: 
--------------------------------------------------------------------------------
  41:             return Triangle.Type.EQUILATERAL
  42:         
  43:         if (trian == 1 and Decimal(a) + Decimal(b) > Decimal(c)):
  44:             return Triangle.Type.ISOSCELES
- 45:         elif (trian == 2 and Decimal(a) + Decimal(c) > Decimal(b)):
+ 45:         elif (trian != 2 and Decimal(a) + Decimal(c) > Decimal(b)):
  46:             return Triangle.Type.ISOSCELES
  47:         elif (trian == 3 and Decimal(b) + Decimal(c) > Decimal(a)):
  48:             return Triangle.Type.ISOSCELES
  49:         
--------------------------------------------------------------------------------
[0.00000 s] killed by test_killMutant23_24_25_46 (test_mutationAdequate.MutantAdequateTest)

   - [#  48] ROR isTriangle: 
--------------------------------------------------------------------------------
  41:             return Triangle.Type.EQUILATERAL
  42:         
  43:         if (trian == 1 and Decimal(a) + Decimal(b) > Decimal(c)):
  44:             return Triangle.Type.ISOSCELES
- 45:         elif (trian == 2 and Decimal(a) + Decimal(c) > Decimal(b)):
+ 45:         elif (trian == 2 and Decimal(a) + Decimal(c) < Decimal(b)):
  46:             return Triangle.Type.ISOSCELES
  47:         elif (trian == 3 and Decimal(b) + Decimal(c) > Decimal(a)):
  48:             return Triangle.Type.ISOSCELES
  49:         
--------------------------------------------------------------------------------
[0.00000 s] killed by test_killMutant5_12_18_33_47_48 (test_mutationAdequate.MutantAdequateTest)

   - [#  49] ROR isTriangle: 
--------------------------------------------------------------------------------
  41:             return Triangle.Type.EQUILATERAL
  42:         
  43:         if (trian == 1 and Decimal(a) + Decimal(b) > Decimal(c)):
  44:             return Triangle.Type.ISOSCELES
- 45:         elif (trian == 2 and Decimal(a) + Decimal(c) > Decimal(b)):
+ 45:         elif (trian == 2 and Decimal(a) + Decimal(c) >= Decimal(b)):
  46:             return Triangle.Type.ISOSCELES
  47:         elif (trian == 3 and Decimal(b) + Decimal(c) > Decimal(a)):
  48:             return Triangle.Type.ISOSCELES
  49:         
--------------------------------------------------------------------------------
[0.00000 s] killed by test_killMutant49 (test_mutationAdequate.MutantAdequateTest)

   - [#  50] ROR isTriangle: 
--------------------------------------------------------------------------------
  43:         if (trian == 1 and Decimal(a) + Decimal(b) > Decimal(c)):
  44:             return Triangle.Type.ISOSCELES
  45:         elif (trian == 2 and Decimal(a) + Decimal(c) > Decimal(b)):
  46:             return Triangle.Type.ISOSCELES
- 47:         elif (trian == 3 and Decimal(b) + Decimal(c) > Decimal(a)):
+ 47:         elif (trian != 3 and Decimal(b) + Decimal(c) > Decimal(a)):
  48:             return Triangle.Type.ISOSCELES
  49:         
  50:         return Triangle.Type.INVALID
--------------------------------------------------------------------------------
[0.00000 s] killed by test_killMutant23_24_25_46 (test_mutationAdequate.MutantAdequateTest)

   - [#  51] ROR isTriangle: 
--------------------------------------------------------------------------------
  43:         if (trian == 1 and Decimal(a) + Decimal(b) > Decimal(c)):
  44:             return Triangle.Type.ISOSCELES
  45:         elif (trian == 2 and Decimal(a) + Decimal(c) > Decimal(b)):
  46:             return Triangle.Type.ISOSCELES
- 47:         elif (trian == 3 and Decimal(b) + Decimal(c) > Decimal(a)):
+ 47:         elif (trian == 3 and Decimal(b) + Decimal(c) < Decimal(a)):
  48:             return Triangle.Type.ISOSCELES
  49:         
  50:         return Triangle.Type.INVALID
--------------------------------------------------------------------------------
[0.00000 s] killed by test_killMutant6_19_43_50_51 (test_mutationAdequate.MutantAdequateTest)

   - [#  52] ROR isTriangle: 
--------------------------------------------------------------------------------
  43:         if (trian == 1 and Decimal(a) + Decimal(b) > Decimal(c)):
  44:             return Triangle.Type.ISOSCELES
  45:         elif (trian == 2 and Decimal(a) + Decimal(c) > Decimal(b)):
  46:             return Triangle.Type.ISOSCELES
- 47:         elif (trian == 3 and Decimal(b) + Decimal(c) > Decimal(a)):
+ 47:         elif (trian == 3 and Decimal(b) + Decimal(c) >= Decimal(a)):
  48:             return Triangle.Type.ISOSCELES
  49:         
  50:         return Triangle.Type.INVALID
--------------------------------------------------------------------------------
[0.00000 s] killed by test_killMutant52 (test_mutationAdequate.MutantAdequateTest)
